Tekla Open API Reference for Tekla Structures 2025
PlacingDistanceAttributes Class
 The PlacingDistanceAttributes class contains the basic attributes for placing distances.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.GenericAttributesBase
 Tekla.Structures.Drawing.PlacingDistanceAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class PlacingDistanceAttributes : GenericAttributesBase,
	ICloneable
<SerializableAttribute>
Public NotInheritable Class PlacingDistanceAttributes
	Inherits GenericAttributesBase
	Implements ICloneable
The PlacingDistanceAttributes type exposes the following members.
Constructors
Name | Description
PlacingDistanceAttributes()
 Initializes a new instance of the PlacingDistanceAttributes class. The default values are a 0.0 search margin and a 0.0 minimal distance.
PlacingDistanceAttributes(Double, Double)
 Creates a new placing distance attributes instance with the given search marginal and minimal distance.
PlacingDistanceAttributes(Double, Double, Double)
 Creates a new placing distance attributes instance with the given search margin, minimal and maximal distance.
Top
Properties
Name | Description
MaximalDistance
 Gets or sets the maximal distance for placing.
MinimalDistance
 Gets or sets the minimal distance for placing.
SearchMargin
 Gets or sets the search marginal for placing.
Top
Methods
Name | Description
Clone
 Creates a new object that is a copy of the current instance.
IsEqual
 Compares the current object with an object of the same type.
 (Overrides GenericAttributesBase.IsEqual(Object).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace